#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	
	Если Не Пользователь = Неопределено Тогда
		Если Пользователь.АутентификацияСтандартная Тогда
			ВходРазрешен = Пользователь.АутентификацияСтандартная;
			ИмяДляВхода = Пользователь.Имя;
//			Пароль = Пользователь.Пароль;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	
	Если ВходРазрешен = Истина Тогда	
		Если Пользователь = Неопределено Тогда
			НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
			НовыйПользователь.Имя = ТекущийОбъект.Наименование;
			НовыйПользователь.АутентификацияСтандартная = Истина;
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
//			НовыйПользователь.Пароль = СгенерироватьПароль();
			НовыйПользователь.Записать();
			ТекущийОбъект.ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор;
			ИмяДляВхода = НовыйПользователь.Имя;
//			Пароль = НовыйПользователь.Пароль
		Иначе
			Пользователь.АутентификацияСтандартная = Истина;
			Пользователь.Записать();
			ИмяДляВхода = Пользователь.Имя;
//			Пароль = Пользователь.Пароль;
		КонецЕсли;
	Иначе
		Пользователь.АутентификацияСтандартная = Ложь;
		Пользователь.Записать();
		ИмяДляВхода = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СлучайныйПароль(Команда)
	
	Пароль = СгенерироватьПароль();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СгенерироватьПароль()
	
	Пароль = "";
	#Если Не ВебКлиент Тогда
		СимволыДляПароля = "abcdefghijklmnopqrstuvwxyz0123456789";
		ГСЧ = Новый ГенераторСлучайныхЧисел();
		Для Сч = 1 По 6 Цикл
			Пароль = Пароль + Сред(СимволыДляПароля, ГСЧ.СлучайноеЧисло(0, СтрДлина(СимволыДляПароля) - 1), 1);
		КонецЦикла;
		Элементы.Пароль.РежимПароля = Ложь;
	#КонецЕсли
	
	Возврат Пароль;
КонецФункции

#КонецОбласти

