#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонстантыНаборВестиРасчетЗарплатыПриИзменении(Элемент)
	КонстантыНаборВестиРасчетЗарплатыПриИзмененииНаСервере();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КонстантыНаборВестиРасчетЗарплатыПриИзмененииНаСервере()
	Константы.ВестиРасчетЗарплаты.Установить(КонстантыНабор.ВестиРасчетЗарплаты);
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	КонстантыНабор.ВестиРасчетЗарплаты = Константы.ВестиРасчетЗарплаты.Получить();
КонецПроцедуры

#КонецОбласти





